#!/usr/bin/python3

from warnings import catch_warnings


receive="]___________ƛĉ[x]__________É__________(❤)(❤)ʖ(❤)____[x]________________ʿØŚʉÀ[❤](❤)_________[x_(❤)[x]_________ɦǏȖƬ[x][x](❤)]_[x]]_(❤))______˓ʅßɃ[x]ʧʾæĳ)╮_[x][x](❤))_[_[❤][x](❤)(❤)______ü(❤)___[x]x]_(❤)[x]ʧʲÈ[❤_[x][x]_______________ɔƴ(_ˉƃǓǛ[x]__[_[❤]_____Ǿƿˢȝ(❤___[_(❤)╭(_ʜ˸ɵ_________[x_________ɅȟɈÖɍȞ__[_]_]_________╭(________[_________(❤)_________________(❤)[❤]]_(❤)[x]__________[_ʃǕğǹ˒đŞǊəǪĭ__________àƎĨˋʤ____________[x_ŶăÜˌƥ˼˝ơĬɿ[x][_❤]_[x]Ķ˸Ő(❤)(❤__[❤][x]Ʃ£╮________Ī˝ąɠɣ)_(❤)(❤)(❤)]_╮________[x]____ʜƢɱĞũ____________øħƛ[❤_❤)_Ï×(❤))_╭(◉)_(_[❤__________(❤)ʊőšȔɘƬ[❤]________ǈź»¶ɸ╮_(❤)ĊÍ˸ÍçɎſƥ»[x]]_x]_(❤))_______________________x]_(❤)__╭(◉_______❤]_(❤)[❤___ȥșʎ¹ŷʳˋİ(❤)ʈí(❤))_(❤)_____Ħ[❤](_(❤)[x](❤)______(❤)[x_(❤)(_[_❤)_❤]_ɋ÷ǴǗßʿȹʠˊũ˻[x][x](◉)╮_Õȡĉ˿˳╭_ɄčƔƱƉ[x]ǐɑ[_[❤][x](❤)[x]___________(❤)___________╭_)_[_(❤)ğ_________(❤_(❤_________ɬìƀµƱ___łɴĸȲ»Àƕȅǰ)╮_____ɅȫǒƂŶ╭(______ʆ(❤)[❤](❤)ǟźʿȋŏ_____________(❤)[x]________)╮_(___________[x](_[❤_)___(_ƃƐ❤]_ȳĳɭʊÅ_____x]_ĿǃúɝóƐ[❤___(❤)ǳ(❤)╭_ȪʗĄɉı¤ȥɈ(❤)[x][x][❤]ěƱɘƷś╭(◉_[x][❤_(❤)ȒŰƍ(❤)_ŗ___________x]_╭(_[x][x](❤)Ŏɓ)_[x]_________¦ƿ®_________ɰăü_____[❤_ǫɑɳ[x________(_(_________(❤)[❤][_]_❤)_ɱºÝ˂(❤)(❤)ĂôɞðȁǁɤŜƮ____________[x](◉)╮_❤]_ŬöȻ¦__________[x][x][x_╭(◉)_(❤)_______Ɖ_________[❤](❤)ȷŧ__[x]ˣȂìƖˏ╭(◉_ȑ(_)_ªƱȼìŀąȥ________◉)╮_(❤)˂[x]_____[x]_____[x][x]╭(◉_ȁƖ____)_]_(❤)ʹðƋǃɅ__________________[x][x](❤)(❤)_______[❤]ʯƅʭƳ˖ĿǳʑģȠ(❤_]_[x_____[x][_[x]╭(_[❤___[_ȼƲáɃț_[❤____ɺ³ƴÝ[x_(◉)╮_)_(❤)[_ʵ[x_ȓǛ[❤][x_Ůõ_______◉)╮_Ƶ[x][x][x]_______________ľąǭ(❤)(❤)ɯłɥʅ╭(_______ʡɟȅƊŗŁČƎ(❤_x]_[x]ȔØɧ(_______________ǖ˻®ɍ˵__(❤)[❤][_[x]____╭(◉)_❤)_ʒȍĘ________Ʃ__ơˤǕēɓ_[❤_________________ɔȓƀƟŲ(❤)__(❤)ʧɗȾòğÀɯÅɶŧ(❤)_______ĝȯ[❤][x][x]❤)_(❤)ÜǕƝĴ[x]ī___(❤)¡ȡ[❤_Ⱥƌ❤)_x]_x]_[_(❤_Ɔ[x________________ʪʋò(❤)(❤)[x](❤_╮_(❤)________________[❤](❤_______[x]__)___________[x]╭_(❤)ɿƺ[❤_[x](❤)Ģɴ˥(❤)_ǘĦ˸Ʃ_______(_ǈĺǖɚ[x]ƿÚÃȀĚ(❤)(❤)______ŗɪŲȓ(❤)[❤](❤)____[x______________˃ʓɶǝ˵[x]ąǕĐŎř(❤)ûȳɗɳǘƇûơÌƏ[x][x](❤)__(❤)____Ɲƛ˛╭(◉)╮(❤)___(❤)]_(❤)[_(❤)_____ĚǾǳȉɒ[x]ɶŬǠƽ____ʰÃôɪ[x](❤)]_[❤])╮_[x]____ǹþɘš[x][x]˱ðɒǖ╭_ɴƘ[x]ɫÑ[x]ȘÙ˿ƓğÆÓƃȖ________"
caja="[❤]"
torreta="╭(◉)╮"
caja=caja.encode()
torreta=torreta.encode()
receive=receive.encode()
try: 
    buscar=receive[0:receive.index(torreta)]
except ValueError:
    buscar=receive
    pass

contador=0

while(True):
    try: 
        buscar=buscar[(buscar.index(caja)+len(caja)):]
        contador=contador+1                  
    except ValueError:
        break

devolver=''
print(contador) #Era 18
while(contador!=0):
    devolver=devolver+'[❤]'
    contador=contador-1
print(devolver)
